import React from 'react'

export default function QurtionAns() {
    const datas = [
        {
            id: 1,
            qurtion: "এই কোর্স কাদের জন্য?",
            ans: "যে সিরিয়াস হার্ডওয়ার্ক করে ভালো একজন    ফুল স্ট্যাক  ওয়েব ডেভেলপার ( ফ্রন্টএন্ড  + ব্যাকএন্ড) হতে চায় এবং নিজের একটা দক্ষতা অর্জন করতে চায় তার জন্য। যে ধরে ধরে প্রোগ্রামিংয়ের কোর জিনিসগুলো শিখতে চায়। ওয়েব ডেভেলপমেন্ট এর বেসিক টু অ্যাডভান্স জিনিসগুলো শিখতে চায়। তার জন্য।",
        },
        {
            id: 2,
            qurtion: "কোর্স করার ক্ষেত্রে আমার কি কি জিনিস দরকার?",
            ans: "প্রথমত লাগবে ডেডিকেটেড সময়,হার্ডওয়ার্ক করার ইচ্ছা,সময়কে দক্ষতা অর্জনে কাজে ব্যায় করার মাইন্ড সেট।",
        },
        {
            id: 3,
            qurtion: "কোর্স করতে গিয়ে কোথাও আটকে গেলে কি করব?",
            ans: "আমরা কোর্সের জন্য  ফেইসবুক ও ডিসকোড গ্রূপ কমিউনিটি  তৈরি করেছি। যেখানে আমি থাকবো, আমাদের প্রফেশনাল ডেভেলপার থাকবেন, তোমাকে সাপোর্ট করার জন্য। রয়েছে প্রতিদিন দুইবেলা সাপোর্ট সেশন।  আমাদের টার্গেট হচ্ছে--২৪ ঘন্টার মধ্যে তোমার সব প্রশ্নের উত্তর দেয়া। অফলাইন ক্লাস ক্লাসে দক্ষ  ইন্সট্রাক্টর হাতে দরে প্রত্যেকটা প্রবলেম সলভ করে দিবে।",
        },
        {
            id: 4,
            qurtion: "এ কোর্স কমপ্লিট করতে কতদিন সময় লাগবে?",
            ans: "ফ্রন্টএন্ড ডেভেলপার এর কোর্সটা শেষ করতে তিন মাস সময় লাগবে এবং ব্যাকএন্ড ডেভেলপমেন্ট কোর্স শেষ করতে তিন মাস সময়  লাগবে কমপ্লিট ফুলস্ট্যাক ওয়েব ডেভেলপমেন্ট  কোর্স ক্ষেত্রে তাহলে ৬ থেকে ৭ মাস সময় লাগতে পারে এবং জব প্লেসমেন্ট ট্রেনিং এক মাস ।",
        },
        {
            id: 5,
            qurtion: "কোর্সের ক্ষেত্রে শিক্ষাগত ব্যাকগ্রাউন্ড কেমন থাকা দরকার?",
            ans: "আমরা কোর্সটি এমনভাবে সাজিয়েছি যেখানে একাডেমিক ব্যাকগ্রাউন্ড ম্যাটার করে না। তুমি যেকোনো একাডেমিক ব্যাকগ্রাউন্ড থেকে এই কোর্সটি করতে পারবে। চাইলে স্কুল  স্টুডেন্ট,ভার্সিটির স্টুডেন্ট, কলেজের স্টুডেন্ট, চাকরিজীবি, বেকার সবাই যাতে শিখতে পারে সেজন্য একদম শূন্য থেকে শুরু করা হয়েছে।",
        },
        {
            id: 6,
            qurtion: "অনলাইন ও অফলাইন ক্লাস কিভাবে হবে এবং এর জন্য কি প্রয়োজন?",
            ans: "অফলাইন ক্লাস  শরীয়তপুর পুলিশ লাইন কোডিং একাডেমীর কম্পিউটার ল্যাব ক্লাস করানো হবে। অনলাইন ক্লাস ওয়েবসাইট এবং লাইভ ক্লাসের মাধ্যমে পরিচালনা করানো হবে। অফলাইন ক্লাসের ক্ষেত্রে তেমন কিছুর প্রয়োজন নেই। কিন্তু অনলাইন ক্লাসের ক্ষেত্রে কম্পিউটার এবং ভালো ইন্টারনেট কানেকশন প্রয়োজন।",
        },
        {
            id: 7,
            qurtion: "আমার প্রশ্নের উত্তর এখানে নেই। কোথায় প্রশ্ন করবো?",
            ans: "আপনি চাইলে আপনার প্রশ্নটি বিস্তারিত লিখে এবং প্রয়োজনীয় রেফারেন্স যুক্ত করে আমাদের ফেসবুক পেজে ইনবক্স করতে পারেন অথবা পাবলিক গ্রুপে পোস্ট করতে পারেন। এছাড়াও আপনার জন্য আমাদের সাপোর্ট সেন্টার এর নাম্বার - +8801310881055 সকাল 10:00 টা থেকে রাত 10:00 টা পর্যন্ত খোলা থাকবে।",
        },
    ]

    return (
        <section id='faq' className='my-40'>
            <div className=" grid md:grid-cols-2 gap-16 items-center">
                <div>
                    <h1 className="font-semibold text-4xl my-8">সচরাচর জানতে চাওয়া <br/><span className='text-indigo-800'>প্রশ্নের উত্তর</span></h1>
                    <p>আপনাদের কমন কিছু প্রশ্নের উত্তর আমরা এখানে লিস্ট করে দিয়েছি। আমাদের কে প্রশ্ন করার পূর্বে এই লিস্টটি একবার পড়ে নেয়ার অনুরোধ থাকলো। তাহলে আমাদের উত্তরের জন্য আপনাকে অপেক্ষা করতে হবেনা এবং আপনার মূল্যবান সময় বেঁচে যাবে।</p>
                </div>
                <div className=" rounded overflow-hidden h-[400px] overflow-y-scroll">
                    {/* <!-- accordion-tab  --> */}
                    {
                        datas.map((data) =>
                            <div key={data.id} className="group outline-none" tabindex="1">
                                <div className="group flex justify-between px-4 py-4 items-center  transition ease duration-500 cursor-pointer pr-10 relative border-b border-b-gray-700 group-focus:bg-indigo-800 hover:bg-indigo-800 ">
                                    <div className="group-focus:text-white transition duration-500">
                                        {data.qurtion}
                                    </div>
                                    <div className="h-8 w-8 p-2 items-center inline-flex justify-center transform transition ease duration-500 group-focus:text-white group-focus:-rotate-180 absolute top-0 right-0 mb-auto ml-auto mt-2 mr-2">
                                        <svg
                                            xmlns="http://www.w3.org/2000/svg"
                                            fill="none"
                                            viewBox="0 0 24 24"
                                            stroke-width="1.5"
                                            stroke="currentColor">
                                            <path
                                                stroke-linecap="round"
                                                stroke-linejoin="round"
                                                d="M19.5 8.25l-7.5 7.5-7.5-7.5" />
                                        </svg>
                                    </div>
                                </div>
                                <div className="group-focus:max-h-screen max-h-0 bg-gray-800 px-4 overflow-hidden ease duration-500">
                                    <p className="p-2 py-4 pr-8 text-gray-400 text-justify">
                                        {data.ans}
                                    </p>
                                </div>
                            </div>
                        )
                    }
                </div>
            </div>
        </section>
    )
}
