import Image from 'next/image'
import React from 'react'
import offlineBanner from '@/public/offlinebanner.png'
import onlineBanner from '@/public/onlinebanner.png'


export default function Subject() {
    const datasOffline = [
        {
            id: 1,
            title: 'অফলাইন ক্লাস শেখানোর পদ্ধতি',
            Discripition: 'প্রতি সপ্তাহে ৬ দিন Coding Academy  ল্যাবে ক্লাস করানো হবে। সপ্তাহে  চারটা থেকে পাঁচটা  করে মডিউল শিখানো হবে।  ধাপে ধাপে একটার পর একটা টপিক শিখতে পারেন। ওয়েব ডেভেলপমেন্ট বিভিন্ন টেকনোলজি  ডকুমেন্টেশন ধরে ধরে শিখানো হবে। সেই সাথে প্রজেক্ট ভিত্তিক লার্নিং প্রসেস ফলো করার জন্য প্রতিটি মডিউলেই রয়েছে একটি বা দুইটি করে প্রজেক্ট । আপনাদের প্রশ্ন নেয়ার জন্য সপ্তাহের একটি দিনে Q/A সেশন নেয়া হবে।',
        },
        {
            id: 2,
            title: 'ল্যাবে আনলিমিটেড প্রাকটিসের সুবিধা',
            Discripition: 'অফলাইন ক্লাসে  সকাল টু সন্ধা পর্যন্ত ক্লাস করার পরে প্রাকটিস জন্য coding Academy কম্পিউটার  ল্যাব ব্যাবহার করতে পারবে।বিশেষ করে যাদের পারসোনাল  কম্পিউটার নেই তাদের জন্য তাদের জন্য ক্লাস টপিক গুলো প্রাকটিসের জন্য ল্যাব সকাল টু সন্ধা যেকোনো সময় ল্যাব ব্যাবহার সুবিধা রয়েছে।',
        },
        {
            id: 3,
            title: 'কুইজ টেস্ট এবং প্রজেক্ট অ্যাসাইনমেন্ট মাধ্যমে নিজেকে যাচাই করার সুযোগ',
            Discripition: 'আপনারা ক্লাস করে কি শিখলেন সেটা যাচাই করার জন্য প্রতিটি ক্লাসে এর পরে কুইজ এবং প্রতিটি মডিউল শেষে এসাইনমেন্ট থাকছে। কুইজ গুলো আপনারা তাৎক্ষণিক উত্তর দিতে পারবেন এবং একেকটি এসাইনমেন্ট শেষ করার জন্য আপনারা 48-72 ঘন্টা সময় পাবেন। এসাইনমেন্ট করে সোর্স কোড এর গিটহাব লিঙ্ক এবং প্রজেক্টের লাইভ লিঙ্ক আমাদের কে জমা দিতে হবে। প্রতিটি কুইজ এবং এসাইনমেন্টের প্রাপ্ত নম্বর হিসাব রাখা হবে এবং কোর্স শেষে ফাইনাল রেজাল্ট দেয়া হবে।',
        },
        {
            id: 4,
            title: 'কুইজ এবং প্রজেক্ট অ্যাসাইনমেন্ট পরে থাকছে প্রশ্নের সঠিক সমাধান',
            Discripition: 'প্রতিটি কুইজ এর শেষে আপনারা সঠিক উত্তর ব্যাখ্যা সহ দেখতে পারবেন। সবগুলো এসাইনমেন্টের সল্যুশন কোর্স শেষে গিটহাব - এ শেয়ার করে দেয়া হবে যেন আপনারা বেস্ট প্র্যাকটিস এবং পদ্ধতি গুলো আরো ভাল করে যাচাই করে নিতে পারেন।অ্যাসাইনমেন্ট এবং কুইজ টেস্ট নেওয়া কারন হলো  স্টুডেন্ট মধ্যে প্রোগামিং সম্পর্কে আগ্রহ আরো বৃদ্ধি করা। আপনাদের জমা দেয়া এসাইনমেন্ট আমরা ম্যানুয়ালি কোড রিভিউ করে মার্কিং করবো। অ্যাসাইনমেন্ট ফলাফল ইমেইল করে জানানো হবে।',
        },
        {
            id: 5,
            title: 'আটকে গেলে সহায়তার জন্য ডিসকোর্ড এবং ফেসবুক   সাপোর্ট গ্রুপ তো থাকছেই',
            Discripition: 'কোর্স চলাকালীন যেকোন সমস্যার সম্মুখীন হলে, কোথাও আটকে গেলে অথবা বুঝতে না পারলে, আপনার প্রশ্নটি আমাদের ডিসকোর্ড বা ফেসবুক  সাপোর্ট গ্রুপ #hlep দিয়ে নিজের সমস্যা কথা পোস্ট করতে পারবেন। যদি ডিসকোর্ড সাপোর্ট চ্যানেলের মাধ্যমে কোন জটিল সমস্যা সমাধান না করা যায়, তাহলে প্রয়োজনে  গুগল মিটের মাধ্যমে  সমাধান করার চেষ্টা করা হবে। আমরা পুরো কোর্স জুড়ে আপনার সাথে থাকবো এবং সর্বাত্মক সহযোগিতা করার চেষ্টা করবো।',
        },
        {
            id: 6,
            title: 'সহায়তার জন্য রয়েছে প্রতিদিন  দুই বেলা সাপোর্ট সেশন',
            Discripition: 'যেকোন সমস্যার সম্মুখীন হলে, কোথাও আটকে গেলে অথবা বুঝতে না পারলে, তোমার সমস্যা আমাদের সাপোর্ট সেশন এসে সমাধান করে নিবে। প্রতিদিন সকাল এবং রাতে দুইটি সাপোর্ট সেশন হবে। সাপোর্ট সেশন    গুগল মিটের মাধ্যমে  করা হবে।',
        },

    ]
    const datasOnline = [
        {
            id: 1,
            title: 'অনলাইন ক্লাস শেখানোর পদ্ধতি',
            Discripition: 'অনলাইন ক্লাস প্রতি সপ্তাহে চারটা থেকে পাঁচটা  করে মডিউল রিলিজ দেয়া হবে এবং লাইভ ক্লাসের মাধ্যমে  টপিক গুলো বুঝনো হবে। প্রতিটি মডিউলে 10-12 টি প্রি-রেকোর্ডেড ভিডিও থাকবে যেন আপনারা ধাপে ধাপে একটার পর একটা টপিক শিখতে পারেন। ওয়েব ডেভেলপমেন্ট বিভিন্ন টেকনোলজি  ডকুমেন্টেশন ধরে ধরে শিখানো হয়েছে। সেই সাথে প্রজেক্ট ভিত্তিক লার্নিং প্রসেস ফলো করার জন্য প্রতিটি মডিউলেই রয়েছে একটি বা দুইটি করে প্রজেক্ট টিউটোরিয়াল। সাপ্তাহিক ভিডিও গুলো দেখার জন্য আপনারা পুরো সপ্তাহ সময় পাবেন। আপনাদের প্রশ্ন নেয়ার জন্য সপ্তাহের একটি দিনে লাইভ সেশন নেয়া হবে। কোড করতে গিয়ে কোথাও আটকে গেলে থাকছে প্রতিদিন  দুইবেলা সাপোর্ট সেশন।',
        },
        {
            id: 2,
            title: 'কুইজ টেস্ট এবং প্রজেক্ট অ্যাসাইনমেন্ট মাধ্যমে নিজেকে যাচাই করার সুযোগ',
            Discripition: 'আপনারা ভিডিও দেখে কি শিখলেন সেটা যাচাই করার জন্য প্রতিটি ভিডিও এর সাথে কুইজ এবং প্রতিটি মডিউল শেষে এসাইনমেন্ট থাকছে। কুইজ গুলো আপনারা তাৎক্ষণিক উত্তর দিতে পারবেন এবং একেকটি এসাইনমেন্ট শেষ করার জন্য আপনারা 48-72 ঘন্টা সময় পাবেন। এসাইনমেন্ট করে সোর্স কোড এর গিটহাব লিঙ্ক এবং প্রজেক্টের লাইভ লিঙ্ক আমাদের কে জমা দিতে হবে। প্রতিটি কুইজ এবং এসাইনমেন্টের প্রাপ্ত নম্বর হিসাব রাখা হবে এবং কোর্স শেষে ফাইনাল রেজাল্ট দেয়া হবে।',
        },
        {
            id: 3,
            title: 'কুইজ এবং প্রজেক্ট অ্যাসাইনমেন্ট পরে থাকছে প্রশ্নের সঠিক সমাধান',
            Discripition: 'প্রতিটি কুইজ এর শেষে আপনারা সঠিক উত্তর ব্যাখ্যা সহ দেখতে পারবেন। সবগুলো এসাইনমেন্টের সল্যুশন কোর্স শেষে গিটহাব - এ শেয়ার করে দেয়া হবে যেন আপনারা বেস্ট প্র্যাকটিস এবং পদ্ধতি গুলো আরো ভাল করে যাচাই করে নিতে পারেন।অ্যাসাইনমেন্ট এবং কুইজ টেস্ট নেওয়া কারন হলো  স্টুডেন্ট মধ্যে প্রোগামিং সম্পর্কে আগ্রহ আরো বৃদ্ধি করা। আপনাদের জমা দেয়া এসাইনমেন্ট আমরা ম্যানুয়ালি কোড রিভিউ করে মার্কিং করবো। অ্যাসাইনমেন্ট ফলাফল ইমেইল করে জানানো হবে।',
        },
        {
            id: 4,
            title: 'আটকে গেলে সহায়তার জন্য ডিসকোর্ড এবং ফেসবুক   সাপোর্ট গ্রুপ তো থাকছেই',
            Discripition: 'কোর্স চলাকালীন যেকোন সমস্যার সম্মুখীন হলে, কোথাও আটকে গেলে অথবা বুঝতে না পারলে, আপনার প্রশ্নটি আমাদের ডিসকোর্ড বা ফেসবুক  সাপোর্ট গ্রুপ #hlep দিয়ে নিজের সমস্যা কথা পোস্ট করতে পারবেন। যদি ডিসকোর্ড সাপোর্ট চ্যানেলের মাধ্যমে কোন জটিল সমস্যা সমাধান না করা যায়, তাহলে প্রয়োজনে  গুগল মিটের মাধ্যমে  সমাধান করার চেষ্টা করা হবে। আমরা পুরো কোর্স জুড়ে আপনার সাথে থাকবো এবং সর্বাত্মক সহযোগিতা করার চেষ্টা করবো।',
        },
        {
            id: 5,
            title: 'সহায়তার জন্য রয়েছে প্রতিদিন  দুই বেলা সাপোর্ট সেশন',
            Discripition: 'যেকোন সমস্যার সম্মুখীন হলে, কোথাও আটকে গেলে অথবা বুঝতে না পারলে, তোমার সমস্যা আমাদের সাপোর্ট সেশন এসে সমাধান করে নিবে। প্রতিদিন সকাল এবং রাতে দুইটি সাপোর্ট সেশন হবে। সাপোর্ট সেশন    গুগল মিটের মাধ্যমে  করা হবে।',
        }
    ]
    return (
        <section className='my-40'>
            <div className='text-center my-16'>
                <h1 className='font-bold text-3xl mb-4'>কোর্সটি <span className='text-indigo-800'>কিভাবে চলবে</span></h1>
                <p>যেভাবে আমরা আপনাকে একজন দক্ষ ডেভেলপার হয়ে উঠতে সাহায্য করতে পারি</p>
            </div>
            <div className=''>
                <div className='my-16'>
                    <h2 className='font-bold text-2xl mb-4'>আমাদের <span className='text-indigo-800'>অফলাইন কোর্সটি</span> যেভাবে চলবে</h2>
                </div>
                <div className='grid md:grid-cols-2 gap-10 items-center mb-32'>
                    <div>
                        <Image className='w-3/5 mx-auto' src={offlineBanner} alt='কোর্সটি কিভাবে চলবে'></Image>
                    </div>
                    <div className='h-96 overflow-y-scroll ps-6 pt-4'>
                        <ol className="relative border-s border-gray-200">
                            {
                                datasOffline.map((data) =>
                                    <li key={data.id} className="mb-10 ms-6">
                                        <span className="absolute flex items-center justify-center w-6 h-6 bg-indigo-700 rounded-full -start-3 ring-8 text-white">
                                            {data.id}
                                        </span>
                                        <h3 className="flex items-center text-xl font-semibold mb-4">
                                            {data.title}
                                        </h3>

                                        <p className="mb-4 text-base font-normal text-gray-500 dark:text-gray-400">
                                            {data.Discripition}
                                        </p>
                                    </li>
                                )
                            }
                        </ol>
                    </div>
                </div>
            </div>
            <div>
                <div className='my-16'>
                    <h2 className='font-bold text-2xl mb-4'>আমাদের <span className='text-indigo-800'>অনলাইন কোর্সটি</span> যেভাবে চলবে</h2>
                </div>
                <div className='grid md:grid-cols-2 gap-10 items-center'>
                    <div className='h-96 overflow-y-scroll ps-6 pt-4'>
                        <ol className="relative border-s border-gray-200">
                            {
                                datasOnline.map((data) =>
                                    <li key={data.id} className="mb-10 ms-6">
                                        <span className="absolute flex items-center justify-center w-6 h-6 bg-indigo-700 rounded-full -start-3 ring-8 text-white">
                                            {data.id}
                                        </span>
                                        <h3 className="flex items-center text-xl font-semibold mb-4">
                                            {data.title}
                                        </h3>

                                        <p className="mb-4 text-base font-normal text-gray-500 dark:text-gray-400">
                                            {data.Discripition}
                                        </p>
                                    </li>
                                )
                            }
                        </ol>
                    </div>
                    <div>
                        <Image className='w-3/5 mx-auto' src={onlineBanner} alt='কোর্সটি কিভাবে চলবে'></Image>
                    </div>
                </div>
            </div>
        </section>
    )
}
