import Image from 'next/image'
import React from 'react'


export default function Subject() {
    const datas = [
        {
            id: 1,
            title: 'ধাপে ধাপে প্রজেক্ট ভিত্তিক শেখানোর পদ্ধতি',
            Discripition: 'প্রতি সপ্তাহে এক থেকে দুটি করে মডিউল রিলিজ দেয়া হবে এবং প্রতিটি মডিউলে 10-12 টি প্রি-রেকোর্ডেড ভিডিও থাকবে যেন আপনারা ধাপে ধাপে একটার পর একটা টপিক শিখতে পারেন। ভিডিও গুলোতে রিয়্যাক্ট ও নেক্সট জে.এসের ডকুমেন্টেশন ধরে ধরে শিখানো হয়েছে। সেই সাথে প্রজেক্ট ভিত্তিক লার্নিং প্রসেস ফলো করার জন্য প্রতিটি মডিউলেই রয়েছে একটি করে প্রজেক্ট টিউটোরিয়াল। সাপ্তাহিক ভিডিও গুলো দেখার জন্য আপনারা পুরো সপ্তাহ সময় পাবেন। আপনাদের প্রশ্ন নেয়ার জন্য সপ্তাহের একটি দিনে লাইভ সেশন নেয়া হবে। আপনি যদি ভিডিওগুলো স্বল্প সময়ে দেখে ফেলতে পারেন তাহলে এসাইনমেন্টের জন্য সপ্তাহে সময় বেশি পাবেন।',
        },
        {
            id: 2,
            title: 'পরীক্ষার মাধ্যমে নিজেকে যাচাই করার সুযোগ',
            Discripition: 'আপনারা ভিডিও দেখে কি শিখলেন সেটা যাচাই করার জন্য প্রতিটি ভিডিও এর সাথে কুইজ এবং প্রতিটি মডিউল শেষে এসাইনমেন্ট থাকছে। কুইজ গুলো আপনারা তাৎক্ষণিক উত্তর দিতে পারবেন এবং একেকটি এসাইনমেন্ট শেষ করার জন্য আপনারা 48-72 ঘন্টা সময় পাবেন। এসাইনমেন্ট করে সোর্স কোড এর গিটহাব লিঙ্ক এবং প্রজেক্টের লাইভ লিঙ্ক আমাদের কে জমা দিতে হবে। প্রতিটি কুইজ এবং এসাইনমেন্টের প্রাপ্ত নম্বর হিসাব রাখা হবে এবং কোর্স শেষে ফাইনাল রেজাল্ট দেয়া হবে। তবে কুইজ এর মার্ক লিডারবোর্ডে যোগ হলেও ফাইনাল রেজাল্টে যোগ করা হবেনা।',
        },
        {
            id: 3,
            title: 'পরীক্ষার পরে থাকছে প্রশ্নের সঠিক সমাধান',
            Discripition: 'প্রতিটি কুইজ এর শেষে আপনারা সঠিক উত্তর ব্যাখ্যা সহ দেখতে পারবেন। সবগুলো এসাইনমেন্টের সল্যুশন কোর্স শেষে গিটহাব - এ শেয়ার করে দেয়া হবে যেন আপনারা বেস্ট প্র্যাকটিস এবং পদ্ধতি গুলো আরো ভাল করে যাচাই করে নিতে পারেন। আপনাদের জমা দেয়া এসাইনমেন্ট আমরা ম্যানুয়ালি কোড রিভিউ করে মার্কিং করবো। মার্কশিট তৈরী হয়ে গেলে আপনারা ওয়েবসাইটে ব্যক্তিগত ড্যাশবোর্ড থেকে দেখে নিতে পারবেন।',
        },
        {
            id: 4,
            title: 'আটকে গেলে সহায়তার জন্য ডিসকোর্ড সাপোর্ট গ্রুপ তো থাকছেই',
            Discripition: 'কোর্স চলাকালীন যেকোন সমস্যার সম্মুখীন হলে, কোথাও আটকে গেলে অথবা বুঝতে না পারলে, আপনার প্রশ্নটি আমাদের ডিসকোর্ড সাপোর্ট চ্যানেলে পোস্ট করতে পারবেন। যদি ডিসকোর্ড সাপোর্ট চ্যানেলের মাধ্যমে কোন জটিল সমস্যা সমাধান না করা যায়, তাহলে প্রয়োজনে ডিসকোর্ড ভয়েস চ্যানেল / গুগল মিটে কল করেও সমাধান করার চেষ্টা করা হবে। আমরা পুরো কোর্স জুড়ে আপনার সাথে থাকবো এবং সর্বাত্মক সহযোগিতা করার চেষ্টা করবো। তবে ডিভাইস সম্পর্কিত কোন সমস্যার সমাধান দেয়া হবে না',
        },
        {
            id: 5,
            title: 'আরো থাকছে সাপ্তাহিক লাইভ আলোচনা ',
            Discripition: 'প্রতি সপ্তাহে আমরা কমপক্ষে একটি করে লাইভ সেশনের আয়োজন করবো যেখানে পুরো সপ্তাহে যা শেখানো হয়েছে সেটার উপর আলোচনা, এসাইনমেন্ট এর সল্যুশন বুঝিয়ে দেয়া এবং আপনাদের প্রশ্নের সরাসরি উত্তর দেয়া হবে। লাইভ সেশনের সময় আগেই আমাদেরকে ডিসকোর্ড সাপোর্ট চ্যানেলে জানিয়ে দেয়া হবে।',
        },
        {
            id: 6,
            title: 'কোর্স শেষে ফাইনাল পরীক্ষা',
            Discripition: 'পুরো কোর্সের সবগুলো মডিউল শেষ হবার পর অনলাইনে একটি ফাইনাল পরীক্ষা নেয়া হবে। ফাইনাল পরীক্ষায় একটি বড় এসাইনমেন্ট করতে দেয়া হবে। এসাইনমেন্ট রিভিউ করে তারপর আমরা রেজাল্ট পাবলিশ করবো। এই ফাইনাল পরীক্ষার মার্ক এবং আগের সকল এসাইনমেন্ট এর মার্ক যোগ করে আপনার পুরো কোর্সের রেজাল্ট শিট আপনাকে দেয়া হবে।',
        }
    ]
    return (
        <section className='my-40'>
            <div className='text-center my-12'>
                <h1 className='font-bold text-3xl mb-4'>কোর্সটি কিভাবে চলবে</h1>
                <p>যেভাবে আমরা আপনাকে একজন দক্ষ ডেভেলপার হয়ে উঠতে সাহায্য করতে পারি</p>
            </div>
            <div className='grid md:grid-cols-2 gap-10'>
                <div>
                </div>
                <div className='h-96 overflow-y-scroll ps-6 pt-4'>
                    <ol className="relative border-s border-gray-200">
                        {
                            datas.map((data) =>
                                <li key={data.id} className="mb-10 ms-6">
                                    <span className="absolute flex items-center justify-center w-6 h-6 bg-indigo-700 rounded-full -start-3 ring-8 text-white">
                                        {data.id}
                                    </span>
                                    <h3 className="flex items-center text-xl font-semibold mb-4">
                                        {data.title}
                                    </h3>

                                    <p className="mb-4 text-base font-normal text-gray-500 dark:text-gray-400">
                                        {data.Discripition}
                                    </p>
                                </li>
                            )
                        }
                    </ol>
                </div>
            </div>

        </section>
    )
}
